---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.CannotMatchFabricationHangerSizeToHost
source: html/2df28deb-a2a2-1259-5d07-1bafa71cc08e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.CannotMatchFabricationHangerSizeToHost Property

The hanger cannot be re-sized to match the re-sized host.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotMatchFabricationHangerSizeToHost { get; }
```